---
<center><h1> Projeto de Machine Learning </h1></center>

<center><h3> Guilherme Ribeiro Maia </h3></center>

<div class="col">
<div class="coluna">
    <img src= "https://logodownload.org/wp-content/uploads/2018/03/gmail-logo-1.png"  width='30' height='30' align="left"/> 
</div>
<div class="coluna">
    GRIBEIROMAIA91@GMAIL.COM
</div>
</div>

<div class="col">
<div class="coluna">
    <img src= "https://pngimg.com/uploads/linkedIn/linkedIn_PNG16.png"  width='30' height='30' align="left"/> 
</div>
<div class="coluna">
   www.linkedin.com/in/guilherme-ribeiro-maia-650589112/
</div>
</div>

---

# Pacotes

In [1]:
#Pacotes e funções criadas
import pandas as pd
import ajuste_metadados as etapa1
import descritiva_df as etapa2
import get_woe_categoric as etapa3
import get_dummie as etapa4

# Leitura dos dados

In [2]:
#Banco de dados no titanic
df00 = pd.read_csv("titanic.csv")

In [3]:
#Cabeçalho dos dados
df00.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Removendo colunas que não devem ser utilizadas na modelagem
del df00["PassengerId"]
del df00['Name']
del df00['Ticket']
del df00['Cabin']

In [5]:
#Cabeçalho dos dados
df00.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

# Metadados

In [6]:
metadados = etapa1.ajuste_metadados(df00)
metadados

  Variaveis   Role     Level  Keep     Tipo  Cardinality  Qtd_Missing
0  Survived  input   ordinal  True    int64            2            0
1    Pclass  input   ordinal  True    int64            3            0
2       Sex  input   nominal  True   object            2            0
3       Age  input  interval  True  float64           88          177
4     SibSp  input   ordinal  True    int64            7            0
5     Parch  input   ordinal  True    int64            7            0
6      Fare  input  interval  True  float64          248            0
7  Embarked  input   nominal  True   object            3            2

# Descritiva

In [7]:
df_numericos, df_categoricos = etapa2.descritiva_table(dataframe = df00, metadados = metadados)

Número de variáveis categóricas:  2
Número de variáveis contínuas:  6

In [8]:
df_numericos

,qtd,qtd_missing,taxa_missing,desvio,minimo,quantil_01,quantil_10,quantil_25,mediana,media,quantil_75,quantil_90,quantil_99,maximo
Survived,891,0,0.000000,0.486592,0.00,0.0,0.00,0.0000,0.0000,0.383838,1.0,1.0000,1.00000,1.0000
Pclass,891,0,0.000000,0.836071,1.00,1.0,1.00,2.0000,3.0000,2.308642,3.0,3.0000,3.00000,3.0000
Age,891,177,0.198653,14.526497,0.42,1.0,14.00,20.1250,28.0000,29.699118,38.0,50.0000,65.87000,80.0000
SibSp,891,0,0.000000,1.102743,0.00,0.0,0.00,0.0000,0.0000,0.523008,1.0,1.0000,5.00000,8.0000
Parch,891,0,0.000000,0.806057,0.00,0.0,0.00,0.0000,0.0000,0.381594,0.0,2.0000,4.00000,6.0000
Fare,891,0,0.000000,49.693429,0.00,0.0,7.55,7.9104,14.4542,32.204208,31.0,77.9583,249.00622,512.3292

In [9]:
df_categoricos

          qtd  qtd_missing  taxa_missing  cardinalidade
Sex       891            0      0.000000              2
Embarked  891            2      0.002245              3

# Transformações

### WOE

In [10]:
df00_woe, resumo_woe = etapa3.get_woe_categoric(df00, target = 'Survived', name_missing = "missing")

In [11]:
df00_woe.head(5)

    woe_Sex  woe_Embarked
0  0.983833      0.203599
1 -1.529877     -0.688399
2 -1.529877      0.203599
3 -1.529877      0.203599
4  0.983833      0.203599

In [12]:
resumo_woe

,IV Parcial,Maus,Value_Max,WoE,Variavel,Bons,PD,ODDS
0,0.816565,0.681287,female,-1.529877,Sex,0.147541,0.742038,0.216562
1,0.525116,0.318713,male,0.983833,Sex,0.852459,0.188908,2.674688
0,0.093153,0.271930,C,-0.688399,Embarked,0.136612,0.553571,0.502380
1,0.000051,0.087719,Q,-0.024337,Embarked,0.085610,0.389610,0.975956
2,0.029171,0.634503,S,0.203599,Embarked,0.777778,0.336957,1.225806
3,0.023387,0.005848,missing,-4.068677,Embarked,0.000100,1.000000,0.000000

### Dummy

In [13]:
df00_dummy = etapa4.get_dummie(df00, name_missing = 'missing', cardinality = 15, drop_first = True)

In [14]:
df00_dummy.head(5)

   Sex_male  Embarked_Q  Embarked_S  Embarked_missing
0         1           0           1                 0
1         0           0           0                 0
2         0           0           1                 0
3         0           0           1                 0
4         1           0           1                 0

### Definir qual tranformação deixar na base

In [15]:
df00_tratada = pd.concat([
                          df00.drop(['Embarked','Sex'],axis = 1)
                          ,df00_woe
                          #,df00_dummy
                        ],axis = 1)

In [16]:
df00_tratada

     Survived  Pclass   Age  SibSp  Parch     Fare   woe_Sex  woe_Embarked
0           0       3  22.0      1      0   7.2500  0.983833      0.203599
1           1       1  38.0      1      0  71.2833 -1.529877     -0.688399
2           1       3  26.0      0      0   7.9250 -1.529877      0.203599
3           1       1  35.0      1      0  53.1000 -1.529877      0.203599
4           0       3  35.0      0      0   8.0500  0.983833      0.203599
..        ...     ...   ...    ...    ...      ...       ...           ...
886         0       2  27.0      0      0  13.0000  0.983833      0.203599
887         1       1  19.0      0      0  30.0000 -1.529877      0.203599
888         0       3   NaN      1      2  23.4500 -1.529877      0.203599
889         1       1  26.0      0      0  30.0000  0.983833     -0.688399
890         0       3  32.0      0      0   7.7500  0.983833     -0.024337

[891 rows x 8 columns]

# Ajuste de Missing

# Seleção de variáveis

### Univariada

### Bivariada

### Multivariada

# Amostragem

# Modelagem

# Alinhamento

# Adequabilidade

# Estabilidade no tempo

# Interpretação

# Salvando informações para a implantação